tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"

#
# requirements Tools
#
cask "iterm2"
brew "gh"
brew "git"
brew "coreutils"
brew "tree"
brew "nkf"
brew "nmap"
brew "wget"
brew "peco"
brew "readline"
brew "jq"
cask "visual-studio-code"

#
# dotfile Dependencies Tools
#
brew "nvm"

# Docker Software
brew "docker"
brew "docker-completion"
cask "Typora"

